In [1]:
import pandas as pd

In [9]:
names = ['Karthik', 'Nikesh', 'Jai', 'Evesh']
df1 = pd.DataFrame(names)
df1

         0
0  Karthik
1   Nikesh
2      Jai
3    Evesh

In [7]:

names = ['Karthik', 'Nikesh', 'Jai', 'Evesh']
ages = [32, 32, 36, 31]
locations = ['Delhi', 'Bangalore', 'Kolkata', 'Chennai']

data =  list(zip(names, ages, locations))

In [8]:
df2 = pd.DataFrame(data, columns=['Name', 'Ages', 'Location'])
df2

      Name  Ages   Location
0  Karthik    32      Delhi
1   Nikesh    32  Bangalore
2      Jai    36    Kolkata
3    Evesh    31    Chennai

In [5]:
type(data1)

pandas.core.series.Series

In [6]:
data_dict = {"emp_name":['ram','ajay','shrikant','john'],
            "age":[21,21,24,31],
            "Friuts":['Apple','Grapes','Oranges','Pineapple']}

In [7]:
data_dict

{'emp_name': ['ram', 'ajay', 'shrikant', 'john'],
 'age': [21, 21, 24, 31],
 'company': ['Amazon', 'TCS', 'WIPRO', 'CISCO']}

In [8]:
df_dict = pd.DataFrame(data_dict,)

In [10]:
df_dict

   emp_name  age company
0       ram   21  Amazon
1      ajay   21     TCS
2  shrikant   24   WIPRO
3      john   31   CISCO

In [11]:
type(df_dict)

pandas.core.frame.DataFrame